docs/1c-export-2026-06-02/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬКодУКТВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторУКТВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬОтечественныйНеподакцизныйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураГТД</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторУКТВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вага</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Открыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВидео</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Целевой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаYouTube</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>127</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бронь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеАгенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодБрони</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Постачальник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СекторНаСкладі</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коментар</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ефір</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕфірНаДоставку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

docs/1c-export-2026-06-02/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьШтрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьСерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьКачество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеШтрихкода</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.МаршрутныйЛист</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьКод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

docs/1c-export-2026-06-02/Catalogs/ХарактеристикиНоменклатуры/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ОбменДанными.Загрузка
		И НЕ Владелец.ВестиУчетПоХарактеристикам Тогда
		ОбщегоНазначения.СообщитьОбОшибке(
		"Для номенклатуры """ + Владелец + """ не ведется учет по характеристикам.
		|Характеристика """ + Наименование + """ не может быть записана.", 
		Отказ);
		
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЗарегистрироватьИзмененияМешка", 
	Бронь <> Ссылка.Бронь 
	Или ПериодБрони <> Ссылка.ПериодБрони 
	Или  Контрагент <> Ссылка.Контрагент);
	
	Если Не Отказ Тогда
		Если ЕстьВидео <> ЭтотОбъект.Ссылка.ЕстьВидео Тогда
			Если ЕстьВидео Тогда
				Текст2 = "Появилося відео.";
			Иначе
				Текст2 = "Відео видалено.";
			КонецЕсли;
			ОтправитьИнформациюВЧат(Текст2);
		ИначеЕсли Бронь <> ЭтотОбъект.Ссылка.Бронь Или ПериодБрони <> ЭтотОбъект.Ссылка.ПериодБрони Тогда
			Если ЗначениеЗаполнено(НачалоДня(ПериодБрони)) Тогда 
				Текст2 = "Бронь на " + Бронь + " для " + Контрагент + " до " + Формат(ПериодБрони, "ДФ=dd.MM.yyyy") + ".";
			Иначе
				Текст2 = "Вільний";
			КонецЕсли;
			ОтправитьИнформациюВЧат(Текст2);
		КонецЕсли;
		
		
		
		Если (ПустаяСтрока(СекторНаСкладі) И НЕ ПустаяСтрока(Ссылка.СекторНаСкладі)) ИЛИ СекторНаСкладі = "Не вдалось" Тогда 
			СекторНаСкладі = Ссылка.СекторНаСкладі;
		КонецЕсли;
		
		Если ПустаяСтрока(Коментар) И НЕ ПустаяСтрока(Ссылка.Коментар) Тогда 
			Коментар = Ссылка.Коментар;
		КонецЕсли;
		
		Если НЕ Открыт И Ссылка.Открыт Тогда 
			Открыт = Истина;
		КонецЕсли;
		
		Если Ссылка.СекторНаСкладі <> СекторНаСкладі И НЕ ПустаяСтрока(СекторНаСкладі) Тогда 
			ОблікСекторів.РучнаЗмінаСектораНаСкладі(Ссылка, ОблікСекторів.ОтриматиСектор(СекторНаСкладі));
		КонецЕсли;
		
		
	КонецЕсли;
	 


КонецПроцедуры

Процедура ОтправитьИнформациюВЧат(Текст2)
			Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Штрихкоды.Штрихкод
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Владелец = &Владелец
		|	И Штрихкоды.ХарактеристикаНоменклатуры = &Характеристика";
		Запрос.УстановитьПараметр("Владелец", Владелец);
		Запрос.УстановитьПараметр("Характеристика", ЭтотОбъект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		ШК = "";
		Если Выборка.Следующий() Тогда
			ШК = Выборка.Штрихкод;
		КонецЕсли;
		
		Текст = Владелец.Артикул + " / " + ШК + " / " + ЭтотОбъект.Ссылка + " - " + Текст2;
		
		Общий.ОтправитьИнформациюВЧат(Текст);

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция устанавливает новое наименование характеристики по значениям свойств.
//
// Параметры:
//  КоллекцияЗначенийСвойств - коллекция значений, имеющая свойство Значение.
//
// Возвращаемое значение:
//  Строка - сформированное наименование.
//
Функция СформироватьНаименование(КоллекцияЗначенийСвойств) Экспорт

	Строка = "";

	Для каждого ЭлементКоллекции Из КоллекцияЗначенийСвойств Цикл
		
		Если ЗначениеЗаполнено(ЭлементКоллекции.Значение) Тогда
			
			Если ТипЗнч(ЭлементКоллекции.Значение) = Тип("Дата") Тогда
				
				Если ЭлементКоллекции.Свойство.ТипЗначения.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Дата Тогда
					Строка = Строка + Формат(ЭлементКоллекции.Значение, "ДФ=dd.MM.yyyy") + ", ";
				ИначеЕсли ЭлементКоллекции.Свойство.ТипЗначения.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Время Тогда
					Строка = Строка + Формат(ЭлементКоллекции.Значение, "ДФ=ЧЧ:мм:сс") + ", ";
				Иначе
					Строка = Строка + ЭлементКоллекции.Значение + ", ";
				КонецЕсли;
				
			Иначе
				
				Строка = Строка + ЭлементКоллекции.Значение + ", ";
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

	Строка = Лев(Строка, СтрДлина(Строка) - 2);

	Если ПустаяСтрока(Строка) Тогда
		Строка = "<Свойства не назначены>";
	КонецЕсли;

	Возврат Строка;

КонецФункции

Процедура ПриЗаписи(Отказ)
	
	Перем ЗначениеСвойства;
	
	Если Не ОбменДанными.Загрузка И Не ЭтоГруппа И НЕ Отказ Тогда
		
		ТЗ = ОбменАндроид.ПолучитьТорговыхЗаданнойНоменклатуры(Владелец);
		
		
		Для Каждого ТорговийАгент ИЗ ТЗ Цикл
			ОбменАндроид.ЗарегистрироватьОбъектОбменАндроидДляПродавца(Владелец, ТорговийАгент, Ложь);
		КонецЦикла;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ЗарегистрироватьИзмененияМешка", ЗначениеСвойства) 
		И ЗначениеСвойства Тогда 
		РегистрыСведений.ИзмененияБрониХарактеристики.ЗарегистрироватьИзмененияМешка(Ссылка);
	КонецЕсли;
	
	ПоточнийКористувач = ПараметрыСеанса.ТекущийПользователь;
	Если Не ПоточнийКористувач.Наименование = "SOAP" Тогда
		Общий.ЗаписІсторіїЗміниХарактеристики(Ссылка, ПоточнийКористувач);
	КонецЕсли;
	
	

КонецПроцедуры
